% 程序3.2：juxing.m
x=linspace(0,100,10001);               %在0~100的横坐标间取10001个值
h=zeros(10001,1);                     %为矩阵h赋0值
h(1:2001)=0;                         %前2000个值取为0值
h(2002:8003)=1;                      %窗长 ，窗内值取为1 
h(8004:10001)=0;                     %后2000个值取为0值
figure(1);                            %定义图号
subplot(1,2,1)                        %画第一个子图
plot(x,h,'k');                          %画波形，横坐标为x，纵坐标为h，k表示黑色
title('矩形窗时域波形');                %图标题
xlabel('样点数');                      %横坐标名称
ylabel('幅度');                        %纵坐标名称
axis([0,100,-0.5,1.5])                  %限定横、纵坐标范围
line([0,100],[0,0])                    %画出x轴

w1=linspace(0,61,61);                %取窗长内的61个点
w1(1:61)=1;                        %赋值1，相当于矩形窗 
w2=fft(w1,1024);                    %对时域信号进行1024点的傅立叶变换
w3=w2/w2(1)                       %幅度归一化
w4=20*log10(abs(w3));               %对归一化幅度取对数
w=2*[0:1023]/1024;                  %频率归一化
subplot(1,2,2);                       %画第二个子图
plot(w,w4,'k')                        %画幅度特性图
axis([0,1,-100,0])                     %限定横、纵坐标范围
title('矩形窗幅度特性');               %图标题
xlabel('归一化频率 f/fs');           %横坐标名称
ylabel('幅度/dB');                 %纵坐标名称
